NordicSemiconductor/nrfx/mdk/nrf54l20_enga_application_peripherals.h
/*

Copyright (c) 2010 - 2025, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF54L20_ENGA_APPLICATION_PERIPHERALS_H
#define NRF54L20_ENGA_APPLICATION_PERIPHERALS_H

#ifdef __cplusplus
    extern "C" {
#endif

#include <stdbool.h>
/*CACHEDATA*/
#define CACHEDATA_PRESENT 1
#define CACHEDATA_COUNT 1

#define ICACHEDATA_NUMSETS_MIN 0                     /*!< Number of sets : 0..127                                              */
#define ICACHEDATA_NUMSETS_MAX 127                   /*!< Number of sets : 0..127                                              */
#define ICACHEDATA_NUMSETS_SIZE 128                  /*!< Number of sets : 0..127                                              */
#define ICACHEDATA_NUMWAYS_MIN 0                     /*!< Number of ways : 0..1                                                */
#define ICACHEDATA_NUMWAYS_MAX 1                     /*!< Number of ways : 0..1                                                */
#define ICACHEDATA_NUMWAYS_SIZE 2                    /*!< Number of ways : 0..1                                                */
#define ICACHEDATA_NUMDATAUNIT_MIN 0                 /*!< Number of data units : 0..3                                          */
#define ICACHEDATA_NUMDATAUNIT_MAX 3                 /*!< Number of data units : 0..3                                          */
#define ICACHEDATA_NUMDATAUNIT_SIZE 4                /*!< Number of data units : 0..3                                          */
#define ICACHEDATA_DATAWIDTH_MIN 0                   /*!< Data width of a data unit : 0..1 words                               */
#define ICACHEDATA_DATAWIDTH_MAX 1                   /*!< Data width of a data unit : 0..1 words                               */
#define ICACHEDATA_DATAWIDTH_SIZE 2                  /*!< Data width of a data unit : 0..1 words                               */

/*CACHEINFO*/
#define CACHEINFO_PRESENT 1
#define CACHEINFO_COUNT 1

#define ICACHEINFO_NUMSETS_MIN 0                     /*!< Number of sets : 0..127                                              */
#define ICACHEINFO_NUMSETS_MAX 127                   /*!< Number of sets : 0..127                                              */
#define ICACHEINFO_NUMSETS_SIZE 128                  /*!< Number of sets : 0..127                                              */
#define ICACHEINFO_NUMWAYS_MIN 0                     /*!< Number of ways : 0..1                                                */
#define ICACHEINFO_NUMWAYS_MAX 1                     /*!< Number of ways : 0..1                                                */
#define ICACHEINFO_NUMWAYS_SIZE 2                    /*!< Number of ways : 0..1                                                */
#define ICACHEINFO_NUMDATAUNIT_MIN 0                 /*!< Number of data units : 0..7                                          */
#define ICACHEINFO_NUMDATAUNIT_MAX 7                 /*!< Number of data units : 0..7                                          */
#define ICACHEINFO_NUMDATAUNIT_SIZE 8                /*!< Number of data units : 0..7                                          */
#define ICACHEINFO_DATAWIDTH_MIN 0                   /*!< Data width of a data unit : 0..3 words                               */
#define ICACHEINFO_DATAWIDTH_MAX 3                   /*!< Data width of a data unit : 0..3 words                               */
#define ICACHEINFO_DATAWIDTH_SIZE 4                  /*!< Data width of a data unit : 0..3 words                               */
#define ICACHEINFO_TAGWIDTH_MIN 0                    /*!< TAG width : 0..23                                                    */
#define ICACHEINFO_TAGWIDTH_MAX 23                   /*!< TAG width : 0..23                                                    */
#define ICACHEINFO_TAGWIDTH_SIZE 24                  /*!< TAG width : 0..23                                                    */
#define ICACHEINFO_DU_EXTENSION 0                    /*!< (unspecified)                                                        */

/*Trace Port Interface Unit*/
#define TPIU_PRESENT 1
#define TPIU_COUNT 1

/*Embedded Trace Macrocell*/
#define ETM_PRESENT 1
#define ETM_COUNT 1

/*CPU control*/
#define CPUC_PRESENT 1
#define CPUC_COUNT 1

/*Cache*/
#define CACHE_PRESENT 1
#define CACHE_COUNT 1

#define ICACHE_VIRTUALCACHE 0                        /*!< (unspecified)                                                        */
#define ICACHE_FLUSH 0                               /*!< (unspecified)                                                        */
#define ICACHE_CLEAN 0                               /*!< (unspecified)                                                        */
#define ICACHE_NONCACHEABLEMISS 0                    /*!< (unspecified)                                                        */
#define ICACHE_BUSWIDTH_MIN 0                        /*!< Data bus width : 0..63                                               */
#define ICACHE_BUSWIDTH_MAX 63                       /*!< Data bus width : 0..63                                               */
#define ICACHE_BUSWIDTH_SIZE 64                      /*!< Data bus width : 0..63                                               */

/*Software interrupt*/
#define SWI_PRESENT 1
#define SWI_COUNT 4

/*Factory Information Configuration Registers*/
#define FICR_PRESENT 1
#define FICR_COUNT 1

/*User Information Configuration Registers*/
#define UICR_PRESENT 1
#define UICR_COUNT 1

/*Factory Information Configuration Registers*/
#define SICR_PRESENT 1
#define SICR_COUNT 1

/*CRACENCORE*/
#define CRACENCORE_PRESENT 1
#define CRACENCORE_COUNT 1

#define CRACENCORE_CRYPTMSTRDMAREGS 1                /*!< (unspecified)                                                        */
#define CRACENCORE_CRYPTMSTRHWREGS 1                 /*!< (unspecified)                                                        */
#define CRACENCORE_RNGCONTROLREGS 1                  /*!< (unspecified)                                                        */
#define CRACENCORE_PKREGS 1                          /*!< (unspecified)                                                        */
#define CRACENCORE_IKGREGS 1                         /*!< (unspecified)                                                        */
#define CRACENCORE_RNGDATAREGS 1                     /*!< (unspecified)                                                        */
#define CRACENCORE_EXTPRIVKEYSREGS 0                 /*!< (unspecified)                                                        */
#define CRACENCORE_LITESMALLRESETVALUES 0            /*!< (unspecified)                                                        */
#define CRACENCORE_LITEMEDIUMRESETVALUES 1           /*!< (unspecified)                                                        */
#define CRACENCORE_FULLRESETVALUES 0                 /*!< (unspecified)                                                        */
#define CRACENCORE_CRACENRESETVALUES 1               /*!< (unspecified)                                                        */
#define CRACENCORE_SHA3RESETVALUES 0                 /*!< (unspecified)                                                        */
#define CRACENCORE_PKE_DATA_MEMORY 0x50018000        /*!< (unspecified)                                                        */
#define CRACENCORE_PKE_DATA_MEMORY_SIZE 16384        /*!< (unspecified)                                                        */
#define CRACENCORE_PKE_CODE_MEMORY 0x5001C000        /*!< (unspecified)                                                        */
#define CRACENCORE_PKE_CODE_MEMORY_SIZE 8192         /*!< (unspecified)                                                        */

